app/controllers/posts_controller.rb

	def create
	@post = Post.new(params.require(:post).permit(:title, :description))
	#  @post = Post.new(params)
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Greeting"], ["description", "Hello World!"], ["created_at", "2022-03-09 13:18:35.261100"], ["updated_at", "2022-03-09 13:18:35.261100"]]

	def update
	  @post = Post.find(params[:id])
	  @post.update(params.require(:post).permit(:title, :description))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "Ramen, pizza, and  pasta"], ["updated_at", "2022-03-09 13:28:20.976070"], ["id", 3]]